             CMD        PROMPT('Scan Qshell Log for Parm Vals')
             PARM       KWD(RETURN01) TYPE(*CHAR) LEN(255) +
                          RTNVAL(*YES) CASE(*MIXED) PROMPT('Return +
                          parm 1 (255)')
             PARM       KWD(RETURN02) TYPE(*CHAR) LEN(255) +
                          RTNVAL(*YES) CASE(*MIXED) PROMPT('Return +
                          parm 2 (255)')
             PARM       KWD(RETURN03) TYPE(*CHAR) LEN(255) +
                          RTNVAL(*YES) CASE(*MIXED) PROMPT('Return +
                          parm 3 (255)')
             PARM       KWD(RETURN04) TYPE(*CHAR) LEN(255) +
                          RTNVAL(*YES) CASE(*MIXED) PROMPT('Return +
                          parm 4 (255)')
             PARM       KWD(RETURN05) TYPE(*CHAR) LEN(255) +
                          RTNVAL(*YES) CASE(*MIXED) PROMPT('Return +
                          parm 5 (255)')
             PARM       KWD(RETURN06) TYPE(*CHAR) LEN(255) +
                          RTNVAL(*YES) CASE(*MIXED) PROMPT('Return +
                          parm 6 (255)')
             PARM       KWD(RETURN07) TYPE(*CHAR) LEN(255) +
                          RTNVAL(*YES) CASE(*MIXED) PROMPT('Return +
                          parm 7 (255)')
             PARM       KWD(RETURN08) TYPE(*CHAR) LEN(255) +
                          RTNVAL(*YES) CASE(*MIXED) PROMPT('Return +
                          parm 8 (255)')
             PARM       KWD(RETURN09) TYPE(*CHAR) LEN(255) +
                          RTNVAL(*YES) CASE(*MIXED) PROMPT('Return +
                          parm 9 (255)')
             PARM       KWD(RETURN10) TYPE(*CHAR) LEN(255) +
                          RTNVAL(*YES) CASE(*MIXED) PROMPT('Return +
                          parm 10 (255)')
