/*----------------------------------------------------------------------------*/
/* TODO:                                                                      */
/* Check for remote file and replace = *NO and bail out if exists             */
/* Check for remote file and replace = *YES and replace remote                */
/*----------------------------------------------------------------------------*/
             PGM        PARM(&SFTPHOST &SFTPPORT &SFTPUSER &SFTPPASS +
                          &KEYFILE &KEYPASSWD &LOCALFILE +
                          &REMOTEFILE &OPTION &REPLACE &SETPKGPATH +
                          &DSPSTDOUT &LOGSTDOUT &PRTSTDOUT +
                          &DLTSTDOUT &IFSSTDOUT &IFSFILE &IFSOPT +
                          &CCSID &PRTSPLF &PRTUSRDTA &PRTTXT +
                          &PRTHOLD &PRTOUTQALL &PROMPTQSH)

             DCL        VAR(&PROMPTQSH) TYPE(*CHAR) LEN(4)
             DCL        VAR(&KEYFILE) TYPE(*CHAR) LEN(255)
             DCL        VAR(&KEYPASSWD) TYPE(*CHAR) LEN(100)
             DCL        VAR(&SFTPHOST) TYPE(*CHAR) LEN(255)
             DCL        VAR(&SFTPPORT) TYPE(*CHAR) LEN(5)
             DCL        VAR(&SFTPUSER) TYPE(*CHAR) LEN(50)
             DCL        VAR(&SFTPPASS) TYPE(*CHAR) LEN(50)
             DCL        VAR(&OPTION) TYPE(*CHAR) LEN(10)
             DCL        VAR(&REPLACE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LOCALFILE) TYPE(*CHAR) LEN(255)
             DCL        VAR(&REMOTEFILE) TYPE(*CHAR) LEN(255)
             DCL        VAR(&PRTHOLD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PRTOUTQALL) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PRTOUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRTOUTQLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SETPKGPATH) TYPE(*CHAR) LEN(4)
             DCL        VAR(&INPUTFILE) TYPE(*CHAR) LEN(255)
             DCL        VAR(&USERPW) TYPE(*CHAR) LEN(100)
             DCL        VAR(&OWNERPW) TYPE(*CHAR) LEN(100)
             DCL        VAR(&PDFOPTS) TYPE(*CHAR) LEN(8)
             DCL        VAR(&TEMPLATE) TYPE(*CHAR) LEN(255)
             DCL        VAR(&OUTPUTFILE) TYPE(*CHAR) LEN(255)
             DCL        VAR(&OUTPUTTYPE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PARMS) TYPE(*CHAR) LEN(2048)
             DCL        VAR(&PARMLIST)  TYPE(*CHAR) LEN(1024)
             DCL        VAR(&TYPE)      TYPE(*CHAR) LEN(1)
             DCL        VAR(&CURDIR)    TYPE(*CHAR) LEN(128)
             DCL        VAR(&CDLEN)     TYPE(*DEC)  LEN(7 0)
             DCL        VAR(&OUTPUTDST) TYPE(*CHAR) LEN(10) VALUE('*NONE')
             DCL        VAR(&OUTPUTACT) TYPE(*CHAR) LEN(10) VALUE('*N')
             DCL        VAR(&QSHRTN) TYPE(*DEC) LEN(5 0)
             DCL        VAR(&QSHRTNC) TYPE(*CHAR) LEN(5)
             DCL        VAR(&MSGDTA) TYPE(*CHAR) LEN(200)
             DCL        VAR(&MSGDTA4) TYPE(*CHAR) LEN(4)
             DCL        VAR(&CPFID) TYPE(*CHAR) LEN(7)
             DCL        VAR(&CMD) TYPE(*CHAR) LEN(9999)
             DCL        VAR(&STDOUTIFS) TYPE(*CHAR) LEN(255)
             DCL        VAR(&STDOUTFILE) TYPE(*CHAR) LEN(255)
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TEMPDIR) TYPE(*CHAR) LEN(255) +
                          VALUE('/tmp')
             DCL        VAR(&QSHTEMP) TYPE(*CHAR) LEN(255) +
                          VALUE('/tmp/qsh')
             DCL        VAR(&DSPSTDOUT) TYPE(*CHAR) LEN(4)
             DCL        VAR(&LOGSTDOUT) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DLTSTDOUT) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PRTSTDOUT) TYPE(*CHAR) LEN(4)
             DCL        VAR(&IFSSTDOUT) TYPE(*CHAR) LEN(4)
             DCL        VAR(&IFSOPT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IFSFILE) TYPE(*CHAR) LEN(255)
             DCL        VAR(&RTNVAL) TYPE(*CHAR) LEN(6)
             DCL        VAR(&CURJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CURUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CURNBR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&QTIME) TYPE(*CHAR) LEN(9)
             DCL        VAR(&PRTSPLF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRTUSRDTA) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRTTXT) TYPE(*CHAR) LEN(30)
             DCL        VAR(&CCSID) TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERRORS))

/*----------------------------------------------------------------------------*/
/* Extract output queue info.                                                 */
/*----------------------------------------------------------------------------*/
             CHGVAR     VAR(&PRTOUTQ) VALUE(%SST(&PRTOUTQALL 1 10))
             CHGVAR     VAR(&PRTOUTQLIB) VALUE(%SST(&PRTOUTQALL 11 10))

/*----------------------------------------------------------------------------*/
/* lftp util must exist in open source packages directory */
/*----------------------------------------------------------------------------*/
             QSHONI/QSHIFSCHK FILNAM('/QOpenSys/pkgs/bin/lftp')
             MONMSG     MSGID(CPF9898) EXEC(DO)
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('lftp +
                          transfer utility not found. Please +
                          install the open source lftp package') +
                          MSGTYPE(*ESCAPE)
             ENDDO
             MONMSG     MSGID(CPF9897) EXEC(DO)
             ENDDO

/*----------------------------------------------------------------------------*/
/* From and to files required                                                 */
/*----------------------------------------------------------------------------*/
             IF         COND(&LOCALFILE *EQ ' ') THEN(DO)
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('Local +
                          file name must be specified') +
                          MSGTYPE(*ESCAPE)
             ENDDO
             IF         COND(&REMOTEFILE *EQ ' ') THEN(DO)
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('Remote +
                          file name must be specified') +
                          MSGTYPE(*ESCAPE)
             ENDDO

/*----------------------------------------------------------------------------*/
/* Build lftp command line with parms for *SEND                               */
/*----------------------------------------------------------------------------*/
             IF         COND(&OPTION *EQ *SEND) THEN(DO)

             /* Make sure local file exists to send or bail out */
             QSHONI/QSHIFSCHK FILNAM(&LOCALFILE)
             MONMSG     MSGID(CPF9898) EXEC(DO)
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('Local +
                          file' |> &LOCALFILE |> 'not found') +
                          MSGTYPE(*ESCAPE)
             ENDDO
             /* File exists - all good */
             MONMSG     MSGID(CPF9897) EXEC(DO)
             ENDDO

             CHGVAR     VAR(&CMD) VALUE('/QOpenSys/pkgs/bin/lftp')
             /* Set user/pass */
             IF         COND(&SFTPPASS *NE ' ') THEN(DO)
                 CHGVAR     VAR(&CMD) VALUE(&CMD |> '-u' |> &SFTPUSER +
                              |< ',' |< &SFTPPASS)
             ENDDO
             /* Set just user */
             IF         COND(&SFTPPASS *EQ ' ') THEN(DO)
             CHGVAR     VAR(&CMD) VALUE(&CMD |> '-u' |> &SFTPUSER)
             ENDDO
             CHGVAR     VAR(&CMD) VALUE(&CMD |> '-p' |> &SFTPPORT)
             CHGVAR     VAR(&CMD) VALUE(&CMD |> 'sftp://' |< &SFTPHOST)

             /* No key file */
             IF         COND(&KEYFILE *EQ ' ') THEN(DO)
             CHGVAR     VAR(&CMD) VALUE(&CMD |> '-e "put' |> +
                          &LOCALFILE |> '-o' |> &REMOTEFILE |< '; +
                          bye"')
             ENDDO

             /* Key file */
             IF         COND(&KEYFILE *NE ' ') THEN(DO)
             CHGVAR     VAR(&CMD) VALUE(&CMD |> '-e "set +
                          sftp:connect-program \"ssh -a -x -i' |> +
                          &KEYFILE |< '\"; put' |> &LOCALFILE |> +
                          '-o' |> &REMOTEFILE |< '; bye"')
             ENDDO

             ENDDO

/*----------------------------------------------------------------------------*/
/* Build lftp command line with parms for *RECEIVE                            */
/*----------------------------------------------------------------------------*/
             IF         COND(&OPTION *EQ *RECEIVE) THEN(DO)

             /* Make sure no local file exists or replace selected */
             /* No local file for receive. All good*/
             QSHONI/QSHIFSCHK FILNAM(&LOCALFILE)
             MONMSG     MSGID(CPF9898) EXEC(DO)
             ENDDO
             /* File exists. Replace required */
             MONMSG     MSGID(CPF9897) EXEC(DO)
             IF         COND(&REPLACE *EQ *NO) THEN(DO)
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('Local +
                          file' |> &LOCALFILE |> 'exists and replace not selected') +
                          MSGTYPE(*ESCAPE)
             ENDDO
             /* Erase local file before receiving */
             IF         COND(&REPLACE *EQ *YES) THEN(DO)
             ERASE      OBJLNK(&LOCALFILE)
             ENDDO
             ENDDO

             CHGVAR     VAR(&CMD) VALUE('/QOpenSys/pkgs/bin/lftp')
             /* Set user/pass */
             IF         COND(&SFTPPASS *NE ' ') THEN(DO)
                 CHGVAR     VAR(&CMD) VALUE(&CMD |> '-u' |> &SFTPUSER +
                              |< ',' |< &SFTPPASS)
             ENDDO
             /* Set just user */
             IF         COND(&SFTPPASS *EQ ' ') THEN(DO)
             CHGVAR     VAR(&CMD) VALUE(&CMD |> '-u' |> &SFTPUSER)
             ENDDO
             CHGVAR     VAR(&CMD) VALUE(&CMD |> '-p' |> &SFTPPORT)
             CHGVAR     VAR(&CMD) VALUE(&CMD |> 'sftp://' |< &SFTPHOST)

             /* No key file */
             IF         COND(&KEYFILE *EQ ' ') THEN(DO)
             CHGVAR     VAR(&CMD) VALUE(&CMD |> '-e "get' |> +
                          &REMOTEFILE |> '-o' |> &LOCALFILE |< '; +
                          bye"')
             ENDDO

             /* Key file */
             IF         COND(&KEYFILE *NE ' ') THEN(DO)
             CHGVAR     VAR(&CMD) VALUE(&CMD |> '-e "set +
                          sftp:connect-program \"ssh -a -x -i' |> +
                          &KEYFILE |< '\"; get' |> &REMOTEFILE |> +
                          '-o' |> &LOCALFILE |< '; bye"')
             ENDDO
             ENDDO

/*----------------------------------------------------------------------------*/
/* Run Qshell/Pase command line via QSHBASH */
/*----------------------------------------------------------------------------*/
             IF         COND(&PROMPTQSH *EQ *YES) THEN(DO)
             ?          QSHONI/QSHBASH ??CMDLINE(&CMD) +
                          ??DSPSTDOUT(&DSPSTDOUT) +
                          ??LOGSTDOUT(&LOGSTDOUT) +
                          ??PRTSTDOUT(&PRTSTDOUT) +
                          ??DLTSTDOUT(&DLTSTDOUT) +
                          ??IFSSTDOUT(&IFSSTDOUT) ??IFSFILE(&IFSFILE) +
                          ??IFSOPT(&IFSOPT) ??CCSID(&CCSID) +
                          ??PRTSPLF(&PRTSPLF) ??PRTUSRDTA(&PRTUSRDTA)  +
                          ??PRTTXT(&PRTTXT) ??PRTHOLD(&PRTHOLD) +
                          ??PRTOUTQ(&PRTOUTQLIB/&PRTOUTQ)
             ENDDO

             IF         COND(&PROMPTQSH *NE *YES) THEN(DO)
             QSHONI/QSHBASH CMDLINE(&CMD) +
                          DSPSTDOUT(&DSPSTDOUT) +
                          LOGSTDOUT(&LOGSTDOUT) +
                          PRTSTDOUT(&PRTSTDOUT) +
                          DLTSTDOUT(&DLTSTDOUT) +
                          IFSSTDOUT(&IFSSTDOUT) IFSFILE(&IFSFILE) +
                          IFSOPT(&IFSOPT) CCSID(&CCSID) +
                          PRTSPLF(&PRTSPLF) PRTUSRDTA(&PRTUSRDTA) +
                          PRTTXT(&PRTTXT) PRTHOLD(&PRTHOLD) +
                          PRTOUTQ(&PRTOUTQLIB/&PRTOUTQ)
             ENDDO

             IF         COND(&OPTION *EQ *SEND) THEN(SNDPGMMSG +
                          MSGID(CPF9898) MSGF(QCPFMSG) +
                          MSGDTA('Local file' |> &LOCALFILE |> 'was +
                          sent via SFTP to remote file' |> +
                          &REMOTEFILE |> 'on' |> &SFTPHOST) +
                          MSGTYPE(*COMP))
             IF         COND(&OPTION *EQ *RECEIVE) THEN(SNDPGMMSG +
                          MSGID(CPF9898) MSGF(QCPFMSG) +
                          MSGDTA('Remote file' |> &REMOTEFILE |> +
                          'was received vis SFTP to local file' |> +
                          &LOCALFILE |> 'from' |> &SFTPHOST) +
                          MSGTYPE(*COMP))

             RETURN

/*----------------------------------------------------------------------------*/
/* HANDLE ERRORS     */
/*----------------------------------------------------------------------------*/
ERRORS:

             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('Error +
                          occurred while transferring file via +
                          lftp. Please check the joblog') +
                          MSGTYPE(*ESCAPE)

             ENDPGM

